#pragma once

#include <algorithm>
#include <bit>
#include <cstdint>
#include <cstring>
#include <iomanip>
#include <ostream>
#include <stdexcept>
#include <string_view>
#include <type_traits>
#include <vector>

namespace realperf::itch5 {

constexpr std::size_t kMoldUdp64HeaderSize = 20;
constexpr std::size_t kSymbolSize = 8;
constexpr std::size_t kMpidSize = 4;
constexpr std::size_t kIssueSubTypeSize = 2;
constexpr std::size_t kReasonSize = 4;
constexpr std::size_t kTimestampSize = 6;
constexpr std::size_t kSystemEventSize = 12;
constexpr std::size_t kStockDirectorySize = 39;
constexpr std::size_t kStockTradingActionSize = 25;
constexpr std::size_t kRegShoRestrictionSize = 20;
constexpr std::size_t kMarketParticipantPositionSize = 26;
constexpr std::size_t kMwcbDeclineLevelSize = 35;
constexpr std::size_t kMwcbStatusSize = 12;
constexpr std::size_t kIpoQuotingPeriodUpdateSize = 28;
constexpr std::size_t kLuldAuctionCollarSize = 35;
constexpr std::size_t kOperationalHaltSize = 21;
constexpr std::size_t kAddOrderSize = 36;
constexpr std::size_t kAddOrderWithMpidSize = 40;
constexpr std::size_t kOrderExecutedSize = 31;
constexpr std::size_t kOrderExecutedWithPriceSize = 36;
constexpr std::size_t kOrderCancelSize = 23;
constexpr std::size_t kOrderDeleteSize = 19;
constexpr std::size_t kOrderReplaceSize = 35;
constexpr std::size_t kTradeSize = 44;
constexpr std::size_t kCrossTradeSize = 40;
constexpr std::size_t kBrokenTradeSize = 19;
constexpr std::size_t kNoiiSize = 50;
constexpr std::size_t kRetailPriceImprovementSize = 20;
constexpr std::size_t kDirectListingWithCapitalRaiseSize = 48;

enum class MessageType : char {
    system_event = 'S',
    stock_directory = 'R',
    stock_trading_action = 'H',
    reg_sho_restriction = 'Y',
    market_participant_position = 'L',
    mwcb_decline_level = 'V',
    mwcb_status = 'W',
    ipo_quoting_period_update = 'K',
    luld_auction_collar = 'J',
    operational_halt = 'h',
    add_order = 'A',
    add_order_with_mpid = 'F',
    order_executed = 'E',
    order_executed_with_price = 'C',
    order_cancel = 'X',
    order_delete = 'D',
    order_replace = 'U',
    trade = 'P',
    cross_trade = 'Q',
    broken_trade = 'B',
    noii = 'I',
    retail_price_improvement = 'N',
    direct_listing_with_capital_raise = 'O',
};

#pragma pack(push, 1)

struct Header {
    char type;
    std::uint16_t locate;
    std::uint16_t tracking;
    std::uint8_t timestamp[kTimestampSize];
};

struct SystemEvent : Header {
    char event_code;
};

struct StockDirectory : Header {
    char stock[kSymbolSize];
    char market_category;
    char financial_status_indicator;
    std::uint32_t round_lot_size;
    char round_lots_only;
    char issue_classification;
    char issue_sub_type[kIssueSubTypeSize];
    char authenticity;
    char short_sale_threshold_indicator;
    char ipo_flag;
    char luld_reference_price_tier;
    char etp_flag;
    std::uint32_t etp_leverage_factor;
    char inverse_indicator;
};

struct StockTradingAction : Header {
    char stock[kSymbolSize];
    char trading_state;
    char reserved;
    char reason[kReasonSize];
};

struct RegShoRestriction : Header {
    char stock[kSymbolSize];
    char action;
};

struct MarketParticipantPosition : Header {
    char mpid[kMpidSize];
    char stock[kSymbolSize];
    char primary_market_maker;
    char market_maker_mode;
    char market_participant_state;
};

struct MwcbDeclineLevel : Header {
    std::uint64_t level_1;
    std::uint64_t level_2;
    std::uint64_t level_3;
};

struct MwcbStatus : Header {
    char breached_level;
};

struct IpoQuotingPeriodUpdate : Header {
    char stock[kSymbolSize];
    std::uint32_t quotation_release_time;
    char quotation_release_qualifier;
    std::uint32_t price;
};

struct LuldAuctionCollar : Header {
    char stock[kSymbolSize];
    std::uint32_t reference_price;
    std::uint32_t upper_collar_price;
    std::uint32_t lower_collar_price;
    std::uint32_t extension;
};

struct OperationalHalt : Header {
    char stock[kSymbolSize];
    char market_code;
    char action;
};

struct OrderAdd : Header {
    std::uint64_t order_ref;
    char side;
    std::uint32_t shares;
    char stock[kSymbolSize];
    std::uint32_t price;
};

struct OrderAddWithMpid : Header {
    std::uint64_t order_ref;
    char side;
    std::uint32_t shares;
    char stock[kSymbolSize];
    std::uint32_t price;
    char attribution[kMpidSize];
};

struct OrderExecute : Header {
    std::uint64_t order_ref;
    std::uint32_t shares;
    std::uint64_t match;
};

struct OrderExecuteWithPrice : Header {
    std::uint64_t order_ref;
    std::uint32_t shares;
    std::uint64_t match;
    char printable;
    std::uint32_t price;
};

struct OrderCancel : Header {
    std::uint64_t order_ref;
    std::uint32_t canceled_shares;
};

struct OrderDelete : Header {
    std::uint64_t order_ref;
};

struct OrderReplace : Header {
    std::uint64_t original_order_ref;
    std::uint64_t new_order_ref;
    std::uint32_t shares;
    std::uint32_t price;
};

struct Trade : Header {
    std::uint64_t order_ref;
    char side;
    std::uint32_t shares;
    char stock[kSymbolSize];
    std::uint32_t price;
    std::uint64_t match;
};

struct CrossTrade : Header {
    std::uint64_t shares;
    char stock[kSymbolSize];
    std::uint32_t price;
    std::uint64_t match;
    char cross_type;
};

struct BrokenTrade : Header {
    std::uint64_t match;
};

struct Noii : Header {
    std::uint64_t paired_shares;
    std::uint64_t imbalance_shares;
    char imbalance_direction;
    char stock[kSymbolSize];
    std::uint32_t far_price;
    std::uint32_t near_price;
    std::uint32_t current_reference_price;
    char cross_type;
    char price_variation_indicator;
};

struct RetailPriceImprovement : Header {
    char stock[kSymbolSize];
    char interest_flag;
};

struct DirectListingWithCapitalRaise : Header {
    char stock[kSymbolSize];
    char open_eligibility_status;
    std::uint32_t minimum_allowable_price;
    std::uint32_t maximum_allowable_price;
    std::uint32_t near_execution_price;
    std::uint64_t near_execution_time;
    std::uint32_t lower_price_range_collar;
    std::uint32_t upper_price_range_collar;
};

#pragma pack(pop)

static_assert(sizeof(Header) == 11);
static_assert(sizeof(SystemEvent) == kSystemEventSize);
static_assert(sizeof(StockDirectory) == kStockDirectorySize);
static_assert(sizeof(StockTradingAction) == kStockTradingActionSize);
static_assert(sizeof(RegShoRestriction) == kRegShoRestrictionSize);
static_assert(sizeof(MarketParticipantPosition) == kMarketParticipantPositionSize);
static_assert(sizeof(MwcbDeclineLevel) == kMwcbDeclineLevelSize);
static_assert(sizeof(MwcbStatus) == kMwcbStatusSize);
static_assert(sizeof(IpoQuotingPeriodUpdate) == kIpoQuotingPeriodUpdateSize);
static_assert(sizeof(LuldAuctionCollar) == kLuldAuctionCollarSize);
static_assert(sizeof(OperationalHalt) == kOperationalHaltSize);
static_assert(sizeof(OrderAdd) == kAddOrderSize);
static_assert(sizeof(OrderAddWithMpid) == kAddOrderWithMpidSize);
static_assert(sizeof(OrderExecute) == kOrderExecutedSize);
static_assert(sizeof(OrderExecuteWithPrice) == kOrderExecutedWithPriceSize);
static_assert(sizeof(OrderCancel) == kOrderCancelSize);
static_assert(sizeof(OrderDelete) == kOrderDeleteSize);
static_assert(sizeof(OrderReplace) == kOrderReplaceSize);
static_assert(sizeof(Trade) == kTradeSize);
static_assert(sizeof(CrossTrade) == kCrossTradeSize);
static_assert(sizeof(BrokenTrade) == kBrokenTradeSize);
static_assert(sizeof(Noii) == kNoiiSize);
static_assert(sizeof(RetailPriceImprovement) == kRetailPriceImprovementSize);
static_assert(sizeof(DirectListingWithCapitalRaise) == kDirectListingWithCapitalRaiseSize);

static_assert(std::is_trivially_copyable_v<Header>);
static_assert(std::is_trivially_copyable_v<SystemEvent>);
static_assert(std::is_trivially_copyable_v<StockDirectory>);
static_assert(std::is_trivially_copyable_v<StockTradingAction>);
static_assert(std::is_trivially_copyable_v<RegShoRestriction>);
static_assert(std::is_trivially_copyable_v<MarketParticipantPosition>);
static_assert(std::is_trivially_copyable_v<MwcbDeclineLevel>);
static_assert(std::is_trivially_copyable_v<MwcbStatus>);
static_assert(std::is_trivially_copyable_v<IpoQuotingPeriodUpdate>);
static_assert(std::is_trivially_copyable_v<LuldAuctionCollar>);
static_assert(std::is_trivially_copyable_v<OperationalHalt>);
static_assert(std::is_trivially_copyable_v<OrderAdd>);
static_assert(std::is_trivially_copyable_v<OrderAddWithMpid>);
static_assert(std::is_trivially_copyable_v<OrderExecute>);
static_assert(std::is_trivially_copyable_v<OrderExecuteWithPrice>);
static_assert(std::is_trivially_copyable_v<OrderCancel>);
static_assert(std::is_trivially_copyable_v<OrderDelete>);
static_assert(std::is_trivially_copyable_v<OrderReplace>);
static_assert(std::is_trivially_copyable_v<Trade>);
static_assert(std::is_trivially_copyable_v<CrossTrade>);
static_assert(std::is_trivially_copyable_v<BrokenTrade>);
static_assert(std::is_trivially_copyable_v<Noii>);
static_assert(std::is_trivially_copyable_v<RetailPriceImprovement>);
static_assert(std::is_trivially_copyable_v<DirectListingWithCapitalRaise>);

static_assert(alignof(Header) == 1);
static_assert(alignof(SystemEvent) == 1);
static_assert(alignof(StockDirectory) == 1);
static_assert(alignof(StockTradingAction) == 1);
static_assert(alignof(RegShoRestriction) == 1);
static_assert(alignof(MarketParticipantPosition) == 1);
static_assert(alignof(MwcbDeclineLevel) == 1);
static_assert(alignof(MwcbStatus) == 1);
static_assert(alignof(IpoQuotingPeriodUpdate) == 1);
static_assert(alignof(LuldAuctionCollar) == 1);
static_assert(alignof(OperationalHalt) == 1);
static_assert(alignof(OrderAdd) == 1);
static_assert(alignof(OrderAddWithMpid) == 1);
static_assert(alignof(OrderExecute) == 1);
static_assert(alignof(OrderExecuteWithPrice) == 1);
static_assert(alignof(OrderCancel) == 1);
static_assert(alignof(OrderDelete) == 1);
static_assert(alignof(OrderReplace) == 1);
static_assert(alignof(Trade) == 1);
static_assert(alignof(CrossTrade) == 1);
static_assert(alignof(BrokenTrade) == 1);
static_assert(alignof(Noii) == 1);
static_assert(alignof(RetailPriceImprovement) == 1);
static_assert(alignof(DirectListingWithCapitalRaise) == 1);

static_assert(static_cast<Header*>(static_cast<SystemEvent*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<StockDirectory*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<StockTradingAction*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<RegShoRestriction*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<MarketParticipantPosition*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<MwcbDeclineLevel*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<MwcbStatus*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<IpoQuotingPeriodUpdate*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<LuldAuctionCollar*>(nullptr)) == nullptr);
static_assert(static_cast<Header*>(static_cast<OperationalHalt*>(nullptr)) == nullptr);
